app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "summary", "year", "genre", "created_at", "updated_at", "imdb") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "a"], ["summary", "b"], ["year", 33], ["genre", "c"], ["created_at", "2021-03-10 01:49:54.611290"], ["updated_at", "2021-03-10 01:49:54.611290"], ["imdb", "dd"]]
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "title" = ?, "summary" = ?, "year" = ?, "genre" = ?, "updated_at" = ?, "imdb" = ? WHERE "movies"."id" = ?  [["title", "The Truman Show"], ["summary", ""], ["year", 1998], ["genre", ""], ["updated_at", "2021-03-10 20:18:17.700553"], ["imdb", ""], ["id", 5]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)